<?php
// $param = [
//     '0','1','2','3','4','5','6','7','8','9',
//     'a','b','c','d','e','f','g','h','i','j',
//     'k','l','m','n','o','p','q','r','s','t',
//     'u','v','w','x','y','z','A','B','C','D',
//     'E','F','G','H','I','J','K','L','M','N',
//     'O','P','Q','R','S','T','U','V','W','X',
//     'Y','Z'
// ];
//匹配引号中的内容
preg_match('/\'(.*?)\'/', "<script src='http://www.tianqiyang.com/vs.php?id=176'></script>", $maths);
var_dump($maths);
/**
 * /.+/ 非空验证
 * /1[3-8][0-9]\d{8}/ 验证手机
 * /^\w+(\.w+)*@\w+(\.w+)$/ 验证邮箱
 */
